# specify a directory to install
cask_args appdir: '/Applications'
# install packages
brew 'coreutils'
brew 'stow'
brew 'starship'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'gnupg'
brew 'libxslt'
brew 'libtool'
# brew 'unixodbc'
brew 'mise'
brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'rg'
brew 'zoxide'
brew 'fzf'
brew 'direnv'
# brew 'node'
brew 'fzy'
# cask 'hyper'
# need to install java before jenkins
# cask 'java'
brew 'wget'
# Casks
# cask 'google-chrome'
# cask 'alfred'
# cask 'flux'
# cask '1password'
cask 'ghostty'
cask 'zed'
brew 'bat'
# brew 'vim'
brew 'fx'
# brew 'go'
cask 'gifcapture'
brew 'lsd'
brew 'cloudflared'
cask '1password-cli'
brew 'modem-dev/tap/hunk'
