# specify a directory to install
cask_args appdir: '/Applications'

# taps
tap 'cloudflare/cloudflare', trusted: true
tap 'modem-dev/tap', trusted: true
tap 'schpet/tap', trusted: true

# install packages
brew 'coreutils'
brew 'stow'
brew 'starship'
brew 'automake'
brew 'autoconf'
brew 'openssl@3'
brew 'libyaml'
brew 'readline'
brew 'gnupg'
brew 'libxslt'
brew 'libtool'
# brew 'unixodbc'
brew 'mise'
brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'ripgrep'
brew 'zoxide'
brew 'fzf'
# brew 'node'
brew 'fzy'
# brew 'vim'
# brew 'go'
brew 'wget'
brew 'bat'
brew 'fx'
brew 'lsd'
brew 'cloudflared'
brew 'colima'
brew 'docker'
brew 'modem-dev/tap/hunk'

# additional CLI tools
brew 'ansible'
brew 'caddy'
brew 'cmake'
brew 'ffmpeg'
brew 'gh'
brew 'lazydocker'
brew 'libpq'
brew 'magic-wormhole'
brew 'make'
brew 'mkcert'
brew 'mosquitto'
brew 'mprocs'
brew 'openssh'
brew 'pandoc'
brew 'pkgconf'
brew 'poppler'
brew 'schpet/tap/linear'
brew 'slides'
brew 'watch'
brew 'yamllint'
brew 'ykman'
brew 'yubikey-agent'
brew 'zsh'

# Casks
# cask 'google-chrome'
# cask '1password'
cask '1password-cli'
cask 'codex'
cask 'ghostty'
cask 'hammerspoon'
cask 'iterm2'
cask 'orbstack'
cask 'secretive'
cask 'supacode'
cask 'visual-studio-code'
cask 'zed'
